<a href="https://colab.research.google.com/github/shikha2209/creditcard/blob/main/Titanic_M_C_learning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [26]:
import pandas as pd
df = pd.read_csv('/content/ChanDarren_RaiTaran_Lab2a.csv')
df.head(10)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[10 rows x 12 columns]

In [7]:
inputs = df.drop('Survived',axis='columns')
target = df['Survived']

In [12]:
from sklearn.preprocessing import LabelEncoder

In [13]:
le_Pclass = LabelEncoder()
le_Sex = LabelEncoder()
le_Age = LabelEncoder()
le_Fare = LabelEncoder()

In [14]:
inputs['pclass_n'] = le_Pclass.fit_transform(inputs['Pclass'])
inputs['sex_n'] = le_Pclass.fit_transform(inputs['Sex'])
inputs['age_n'] = le_Pclass.fit_transform(inputs['Age'])
inputs['fare_n'] = le_Pclass.fit_transform(inputs['Fare'])

In [16]:
inputs.head()

   PassengerId  Pclass  ... age_n fare_n
0            1       3  ...    28     18
1            2       1  ...    51    207
2            3       3  ...    34     41
3            4       1  ...    47    189
4            5       3  ...    47     43

[5 rows x 15 columns]

In [20]:
inputs_n = inputs.drop(['PassengerId','Pclass','Name','Sex','Age','SibSp','Parch','Ticket','Fare','Cabin','Embarked'], axis = 'columns')

In [21]:
inputs_n

     pclass_n  sex_n  age_n  fare_n
0           2      1     28      18
1           0      0     51     207
2           2      0     34      41
3           0      0     47     189
4           2      1     47      43
..        ...    ...    ...     ...
886         1      1     35      85
887         0      0     24     153
888         2      0     90     131
889         0      1     34     153
890         2      1     42      30

[891 rows x 4 columns]

In [22]:
from sklearn import tree

In [23]:
model = tree.DecisionTreeClassifier()

In [24]:
model.fit(inputs_n,target)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [27]:
model.predict([[2,1,28,18]])

array([0])